In [1]:
import pandas as pd
import numpy as np

In [2]:
age = [23, 25, 26, 32]
students = np.array([['bayo',12,'m'],
            ['tobi',15,'m'],
            ['john',18,'f'],
            ['tony',22,'m']])

age_2 = np.array(age)


print(type(age_2))
print(age_2.dtype)
print(students.shape)

<class 'numpy.ndarray'>
int32
(4, 3)

In [3]:
students[:,1].astype(int).mean()

16.75

### Creating Pandas dataframe

In [4]:
# from numpy array or python list of lists
students_df = pd.DataFrame(data= students, 
                           columns = ['name', 'age', 'gender'])

students_df

   name age gender
0  bayo  12      m
1  tobi  15      m
2  john  18      f
3  tony  22      m

In [5]:
# from python dictioneries

staff = {
    'name': ['john','abdul','bayo','femi','tola'],
    'age': [33,23,43,21,11],
    'gender': ['male','female','male','male','female'],
    'salary': [1200,4500,4300,5500,3400]
}

staff_df = pd.DataFrame(data=staff)

In [6]:
staff_df

    name  age  gender  salary
0   john   33    male    1200
1  abdul   23  female    4500
2   bayo   43    male    4300
3   femi   21    male    5500
4   tola   11  female    3400

In [7]:
#loading a local file

orders_df = pd.read_csv('orders.csv')

In [8]:
orders_df.head(3)

,orderid,orderdate,shippeddate,requireddate,freight,staff,unitprice,quantity,companyname,city,country,companyname.1,quantity_class
0,10293,1996-08-29,1996-09-11,1996-09-26,21.18,Nancy Davolio,50.0,12,Tortuga Restaurante,Mxico D.F.,Mexico,Federal Shipping,low
1,10293,1996-08-29,1996-09-11,1996-09-26,21.18,Nancy Davolio,3.6,10,Tortuga Restaurante,Mxico D.F.,Mexico,Federal Shipping,low
2,10293,1996-08-29,1996-09-11,1996-09-26,21.18,Nancy Davolio,35.1,5,Tortuga Restaurante,Mxico D.F.,Mexico,Federal Shipping,low

In [9]:
church_df = pd.read_csv(r'C:\Users\hp\Documents\church_branch.csv')
church_df

   branch_id branch_name    city
0          1        love  ibadan
1          2       peace   lagos
2          3  holy ghost   abuja
3          4       light  ibadan

In [10]:
# loading data directly from database 

import mysql.connector
from mysql.connector import Error
from IPython.display import clear_output


# define a function for server connection

def connect(user_name, host_name, db_name, password):
    connection = None
    try:
        connection = mysql.connector.connect(
            user = user_name,
            host = host_name,
            database = db_name,
            passwd = password
        )
        print(f'connected to database {db_name} successfully')
    except Error as err:
        print(f'Error: {err}')
        
    return connection

password = input()
clear_output()
connection = connect(user_name='root', host_name='localhost',
                     db_name='northwind', password=password)

# define a query formater function
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
    except Error as err:
        print(f'Error: {err}')
    return result

query_1 = '''

select firstname, lastname, salary
from employees
'''

# create a result set conversion function

data = read_query(connection=connection, query=query_1)

def convert_df(data, columns):
    data_list = []
    for row in data:
        row = list(row)
        data_list.append(row)
    
    data = pd.DataFrame(data = data_list, columns=columns)
    
    return data

connected to database northwind successfully

In [11]:
staff_df = convert_df(data=data, columns=['firstname', 'lastname', 'salary'])

staff_df

  firstname   lastname   salary
0     Nancy    Davolio  2954.55
1    Andrew     Fuller  2254.49
2     Janet  Leverling  3119.15
3  Margaret    Peacock  1861.08
4    Steven   Buchanan  1744.21
5   Michael     Suyama  2004.07
6    Robert       King  1991.55
7     Laura   Callahan  2100.50
8      Anne  Dodsworth  2333.33

In [12]:
query_2 = '''

select o.orderid, o.shipcity,s.companyname as shipper,
    concat_ws(' ', e.firstname, e.lastname) as staff,
    od.unitprice, od.quantity, o.shippeddate, o.requireddate,
    c.companyname,o.shipcountry as country,o.freight,p.productname
from `order details` od
join orders o on o.orderid = od.orderid
join employees e on e.employeeid = o.employeeid
join products p on p.productid = od.productid
join shippers s on s.shipperid = o.shipvia
join customers c on c.customerid = o.customerid
order by od.quantity desc
'''

data = read_query(connection=connection, query= query_2)

columns = ['orderid', 'city','shipper','staff', 'price',
           'quantity','ship date', 'required date','customer', 'country',
           'freight','product']

order_data = convert_df(data=data, columns=columns)

In [13]:
order_data

,orderid,city,shipper,staff,price,quantity,ship date,required date,customer,country,freight,product
0,11072,Graz,United Package,Margaret Peacock,33.2500,130,NaT,1998-06-02,Ernst Handel,Austria,258.6400,Wimmers gute Semmelkndel
1,10764,Graz,Federal Shipping,Michael Suyama,18.0000,130,1997-12-08,1997-12-31,Ernst Handel,Austria,145.4500,Chartreuse verte
2,10776,Graz,Federal Shipping,Nancy Davolio,53.0000,120,1997-12-18,1998-01-12,Ernst Handel,Austria,351.5300,Manjimup Dried Apples
3,10894,Boise,Speedy Express,Nancy Davolio,7.7500,120,1998-02-20,1998-03-18,Save-a-lot Markets,USA,116.1300,Rhnbru Klosterbier
4,10398,Boise,Federal Shipping,Andrew Fuller,19.2000,120,1997-01-09,1997-01-27,Save-a-lot Markets,USA,89.1600,Pt chinois
...,...,...,...,...,...,...,...,...,...,...,...,...
2150,10281,Madrid,Speedy Express,Margaret Peacock,7.3000,1,1996-08-21,1996-08-28,Romero y tomillo,Spain,2.9400,Teatime Chocolate Biscuits
2151,10807,Torino,Speedy Express,Margaret Peacock,18.4000,1,1998-01-30,1998-01-28,Franchi S.p.A.,Italy,1.3600,Boston Crab Meat
2152,10308,Mxico D.F.,Federal Shipping,Robert King,28.8000,1,1996-09-24,1996-10-16,Ana Trujillo Emparedados y helados,Mexico,1.6100,Gudbrandsdalsost
2153,10538,London,Federal Shipping,Anne Dodsworth,34.8000,1,1997-05-16,1997-06-12,B's Beverages,UK,4.8700,Mozzarella di Giovanni
2154,10782,Buenos Aires,Federal Shipping,Anne Dodsworth,12.5000,1,1997-12-22,1998-01-14,Cactus Comidas para llevar,Argentina,1.1000,Gorgonzola Telino

## Getting data from API

In [ ]:
from yahoofinance import HistoricalPrices
import yfinance

request = HistoricalPrices(instrument='AAPL', start_date= '2024-02-28',
                           end_date= '2024-02-27',frequency = 'HOURLY')

request

In [27]:
import yfinance as yf

msft = yf.Ticker("MSFT")

# get all stock info
msft.info

# get historical market data
hist = msft.history(period="1mo")

In [92]:
data = {
        'name':[],
        'age':[],
        'title':[],
        'yearBorn':[],
        'salary':[]
    }
data = pd.DataFrame(data)

data

Empty DataFrame
Columns: [name, age, title, yearBorn, salary]
Index: []

In [89]:
companies = ['MSFT','AAPL']
for i in range(0, len(companies)):
    print(companies[i])

MSFT
AAPL

In [93]:

companies = ['MSFT','AAPL']

for company in range(0,len(companies)):

    age = []
    name = []
    title = []
    yearBorn = []
    salary = []
    
    msft = yf.Ticker(companies[company])

    for i in range(0, 10):
        cols = msft.info['companyOfficers'][i].keys()
        if 'name' not in cols:
            name.append(None)
        else:
            name.append(msft.info['companyOfficers'][i]['name'])
        if 'age' not in cols:
            age.append(None)
        else:
            age.append(msft.info['companyOfficers'][i]['age'])
        if 'title' not in cols:
            title.append(None)
        else:
            title.append(msft.info['companyOfficers'][i]['title'])
        if 'yearBorn' not in cols:
            yearBorn.append(None)
        else:
            yearBorn.append(msft.info['companyOfficers'][i]['yearBorn'])
        if 'totalPay' not in cols:
            salary.append(None)
        else:
            salary.append(msft.info['companyOfficers'][i]['totalPay'])
        
    data_2 = {
        'name':name,
        'age':age,
        'title':title,
        'yearBorn':yearBorn,
        'salary':salary
    }
        
   

    data_2 = pd.DataFrame(data_2)
    data = pd.concat([data, data_2])

data

,name,age,title,yearBorn,salary
0,Mr. Satya Nadella,56.0,Chairman & CEO,1967.0,9276400.0
1,Mr. Bradford L. Smith LCA,64.0,President & Vice Chairman,1959.0,3591277.0
2,Ms. Amy E. Hood,51.0,Executive VP & CFO,1972.0,3452196.0
3,Mr. Christopher David Young,51.0,Executive Vice President of Business Developme...,1972.0,2460507.0
4,Ms. Alice L. Jolla,56.0,Corporate VP & Chief Accounting Officer,1967.0,NaN
5,Mr. James Kevin Scott,51.0,Executive VP of AI & CTO,1972.0,NaN
6,Brett Iversen,NaN,Vice President of Investor Relations,NaN,NaN
7,Mr. Hossein Nowbar,NaN,Chief Legal Officer,NaN,NaN
8,Mr. Frank X. Shaw,NaN,Chief Communications Officer,NaN,NaN
9,Mr. Takeshi Numoto,52.0,Executive VP & Chief Marketing Officer,1971.0,NaN
0,Mr. Timothy D. Cook,62.0,CEO & Director,1961.0,16239562.0
1,Mr. Luca Maestri,60.0,CFO & Senior VP,1963.0,4612242.0
2,Mr. Jeffrey E. Williams,59.0,Chief Operating Officer,1964.0,4637585.0
3,Ms. Katherine L. Adams,59.0,"Senior VP, General Counsel & Secretary",1964.0,4618064.0
4,Ms. Deirdre O'Brien,56.0,Senior Vice President of Retail,1967.0,4613369.0
5,Mr. Chris Kondo,NaN,Senior Director of Corporate Accounting,NaN,NaN
6,Mr. James Wilson,NaN,Chief Technology Officer,NaN,NaN
7,Suhasini Chandramouli,NaN,Director of Investor Relations,NaN,NaN
8,Mr. Greg Joswiak,NaN,Senior Vice President of Worldwide Marketing,NaN,NaN
9,Mr. Adrian Perica,49.0,Head of Corporate Development,1974.0,NaN

In [76]:
['MSFT','AAPL','2222.SR','NVDA','AMAZN','GOOG','META','BRK.B']


usdt = yf.Ticker('AAPL')
usdt.info

{'address1': 'One Apple Park Way',
 'city': 'Cupertino',
 'state': 'CA',
 'zip': '95014',
 'country': 'United States',
 'phone': '408 996 1010',
 'website': 'https://www.apple.com',
 'industry': 'Consumer Electronics',
 'industryKey': 'consumer-electronics',
 'industryDisp': 'Consumer Electronics',
 'sector': 'Technology',
 'sectorKey': 'technology',
 'sectorDisp': 'Technology',
 'longBusinessSummary': 'Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts. In addition, the company offers various services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.',
 'fullTimeEmployees': 161000,
 'companyOfficers': [{'maxAge': 1,
   'name': 'Mr. Timothy D. Cook',
   'age': 62,
   'title': 'CEO & Director',
   'yearBorn': 1961,
   'fiscalYear': 2023,
   'totalPay': 16239562,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. Luca  Maestri',
   'age': 60,
   'title': 'CFO & Senior VP',
   'yearBorn': 1963,
   'fiscalYear': 2023,
   'totalPay': 4612242,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. Jeffrey E. Williams',
   'age': 59,
   'title': 'Chief Operating Officer',
   'yearBorn': 1964,
   'fiscalYear': 2023,
   'totalPay': 4637585,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Ms. Katherine L. Adams',
   'age': 59,
   'title': 'Senior VP, General Counsel & Secretary',
   'yearBorn': 1964,
   'fiscalYear': 2023,
   'totalPay': 4618064,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': "Ms. Deirdre  O'Brien",
   'age': 56,
   'title': 'Senior Vice President of Retail',
   'yearBorn': 1967,
   'fiscalYear': 2023,
   'totalPay': 4613369,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. Chris  Kondo',
   'title': 'Senior Director of Corporate Accounting',
   'fiscalYear': 2023,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. James  Wilson',
   'title': 'Chief Technology Officer',
   'fiscalYear': 2023,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Suhasini  Chandramouli',
   'title': 'Director of Investor Relations',
   'fiscalYear': 2023,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. Greg  Joswiak',
   'title': 'Senior Vice President of Worldwide Marketing',
   'fiscalYear': 2023,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. Adrian  Perica',
   'age': 49,
   'title': 'Head of Corporate Development',
   'yearBorn': 1974,
   'fiscalYear': 2023,
   'exercisedValue': 0,
   'unexercisedValue': 0}],
 'auditRisk': 4,
 'boardRisk': 1,
 'compensationRisk': 5,
 'shareHolderRightsRisk': 1,
 'overallRisk': 1,
 'governanceEpochDate': 1709078400,
 'compensationAsOfEpochDate': 1703980800,
 'maxAge': 86400,
 'priceHint': 2,
 'previousClose': 181.42,
 'open': 181.27,
 'dayLow': 180.95,
 'dayHigh': 182.57,
 'regularMarketPreviousClose': 181.42,
 'regularMarketOpen': 181.27,
 'regularMarketDayLow': 180.95,
 'regularMarketDayHigh': 182.57,
 'dividendRate': 0.96,
 'dividendYield': 0.0053,
 'exDividendDate': 1707436800,
 'payoutRatio': 0.14770001,
 'fiveYearAvgDividendYield': 0.78,
 'beta': 1.312,
 'trailingPE': 28.201712,
 'forwardPE': 25.251741,
 'volume': 15607690,
 'regularMarketVolume': 15607690,
 'averageVolume': 54485704,
 'averageVolume10days': 50640890,
 'averageDailyVolume10Day': 50640890,
 'bid': 181.6,
 'ask': 181.65,
 'bidSize': 1200,
 'askSize': 900,
 'marketCap': 2795833131008,
 'fiftyTwoWeekLow': 143.9,
 'fiftyTwoWeekHigh': 199.62,
 'priceToSalesTrailing12Months': 7.248612,
 'fiftyDayAverage': 188.0558,
 'twoHundredDayAverage': 183.8633,
 'trailingAnnualDividendRate': 0.95,
 'trailingAnnualDividendYield': 0.005236468,
 'currency': 'USD',
 'enterpriseValue': 2836405944320,
 'profitMargins': 0.26163,
 'floatShares': 15414548871,
 'sharesOutstanding': 15441899520,
 'sharesShort': 97665956,
 'sharesShortPriorMonth': 101263039,
 'sharesShortPreviousMonthDate': 1705017600,
 'dateShortInterest': 1707955200,
 'sharesPercentSharesOut': 0.0063,
 'heldPercentInsiders': 0.059369996,
 'heldPercentInstitutions': 0.56676,
 'shortRatio': 1.71,
 'shortPercentOfFloat': 0.0063,
 'impliedSharesOutstanding': 15441899520,
 'bookValue': 4.793,
 'priceToBook': 37.774876,
 'lastFiscalYearEnd': 1696032000,
 'nextFiscalYearEnd': 1727654400,
 'mostRecentQuarter': 1703894400,
 'earningsQuarterlyGrowth': 0.131,
 'netIncomeToCommon': 100912996352,
 'trailingEps': 6.42,
 'forwardEps': 7.17,
 'pegRatio': 2.51,
 'lastSplitFactor': '4:1',
 'lastSplitDate': 1598832000,
 'enterpriseToRevenue': 7.354,
 'enterpriseToEbitda': 21.8,
 '52WeekChange': 0.24336922,
 'SandP52WeekChange': 0.27337718,
 'lastDividendValue': 0.24,
 'lastDividendDate': 1707436800,
 'exchange': 'NMS',
 'quoteType': 'EQUITY',
 'symbol': 'AAPL',
 'underlyingSymbol': 'AAPL',
 'shortName': 'Apple Inc.',
 'longName': 'Apple Inc.',
 'firstTradeDateEpochUtc': 345479400,
 'timeZoneFullName': 'America/New_York',
 'timeZoneShortName': 'EST',
 'uuid': '8b10e4ae-9eeb-3684-921a-9ab27e4d87aa',
 'messageBoardId': 'finmb_24937',
 'gmtOffSetMilliseconds': -18000000,
 'currentPrice': 181.055,
 'targetHighPrice': 250.0,
 'targetLowPrice': 158.0,
 'targetMeanPrice': 201.41,
 'targetMedianPrice': 200.0,
 'recommendationMean': 2.2,
 'recommendationKey': 'buy',
 'numberOfAnalystOpinions': 39,
 'totalCash': 73100001280,
 'totalCashPerShare': 4.734,
 'ebitda': 130108997632,
 'totalDebt': 108040003584,
 'quickRatio': 0.92,
 'currentRatio': 1.073,
 'totalRevenue': 385706000384,
 'debtToEquity': 145.803,
 'revenuePerShare': 24.648,
 'returnOnAssets': 0.21181,
 'returnOnEquity': 1.5426899,
 'freeCashflow': 86563127296,
 'operatingCashflow': 116433002496,
 'earningsGrowth': 0.16,
 'revenueGrowth': 0.021,
 'grossMargins': 0.45027,
 'ebitdaMargins': 0.33733,
 'operatingMargins': 0.33764,
 'financialCurrency': 'USD',
 'trailingPegRatio': 2.2332}